{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/Users/ym1219/Desktop/multilin/models/xlm-roberta-base",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "value",
    "query",
    "key"
  ],
  "task_type": "SEQ_CLS",
  "use_rslora": false
}